Revit 2027 API
ParameterTypeId.StructuralSectionCommonPerimeter Property
 "Perimeter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionCommonPerimeter { get; }
Public Shared ReadOnly Property StructuralSectionCommonPerimeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionCommonPerimeter {
	ForgeTypeId^ get ();
}
static member StructuralSectionCommonPerimeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace